uhnp/src/Catalogs/СпособыОтраженияРасходовПоАмортизацииМСФО/СпособыОтраженияРасходовПоАмортизацииМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СпособыОтраженияРасходовПоАмортизацииМСФО</name>
  <attributes>
    <name>ПланСчетовБД</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатрат</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильРаспределенияНСБУ</name>
    <type>
      <types>DefinedType.ПрофильРаспределенияВНАНСБУ</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Тип должен совпадать с типом в РСБУ</comment>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Способы</name>
    <attributes>
      <name>СчетЗатрат</name>
      <type>
        <types>CatalogRef.СчетаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/СпособыОтраженияРасходовПоАмортизацииМСФО/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если Способы.Количество() = 0 Тогда
		
		//Актуальными считаем реквизиты - заполним ТЧ
		ЦФО = Подразделение;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Подразделение, "ЦФО") Тогда
			ЦФО = Подразделение["ЦФО"];
		КонецЕсли;
		
		НовыйСпособ = Способы.Добавить();
		ОбщегоНазначенияУХ.УстановитьНовоеЗначение(НовыйСпособ.СчетЗатрат,	СчетЗатрат);
		ОбщегоНазначенияУХ.УстановитьНовоеЗначение(НовыйСпособ.Субконто1,	СчетЗатратСубконто1);
		ОбщегоНазначенияУХ.УстановитьНовоеЗначение(НовыйСпособ.Субконто2,	СчетЗатратСубконто2);
		ОбщегоНазначенияУХ.УстановитьНовоеЗначение(НовыйСпособ.Субконто3,	СчетЗатратСубконто3);
		ОбщегоНазначенияУХ.УстановитьНовоеЗначение(НовыйСпособ.Подразделение,			ЦФО);
		ОбщегоНазначенияУХ.УстановитьНовоеЗначение(НовыйСпособ.НаправлениеДеятельности,	НаправлениеДеятельности);

	ИначеЕсли Способы.Количество() = 1 Тогда
		
		//Актуальными считаем Реквизиты - обновим ТЧ по реквизитам
		Способ1 = Способы[0];
		ОбщегоНазначенияУХ.УстановитьНовоеЗначение(СчетЗатрат,			Способ1.СчетЗатрат);
		ОбщегоНазначенияУХ.УстановитьНовоеЗначение(СчетЗатратСубконто1,	Способ1.Субконто1);
		ОбщегоНазначенияУХ.УстановитьНовоеЗначение(СчетЗатратСубконто2,	Способ1.Субконто2);
		ОбщегоНазначенияУХ.УстановитьНовоеЗначение(СчетЗатратСубконто3,	Способ1.Субконто3);
		//ОбщегоНазначенияУХ.УстановитьНовоеЗначение(Подразделение, 		Способ1.Подразделение);
		ОбщегоНазначенияУХ.УстановитьНовоеЗначение(НаправлениеДеятельности,	Способ1.НаправлениеДеятельности);
		
	Иначе
		
		//Когда записей > 1, тогда актуальными считаем ТЧ - очистим реквизиты
		ОбщегоНазначенияУХ.УстановитьНовоеЗначение(СчетЗатрат, Справочники.СчетаБД.ПустаяСсылка());
		ОбщегоНазначенияУХ.УстановитьНовоеЗначение(СчетЗатратСубконто1, Неопределено);
		ОбщегоНазначенияУХ.УстановитьНовоеЗначение(СчетЗатратСубконто2, Неопределено);
		ОбщегоНазначенияУХ.УстановитьНовоеЗначение(СчетЗатратСубконто3, Неопределено);

	КонецЕсли;
	
	НовоеЗначение = Справочники.СпособыОтраженияРасходовПоАмортизацииМСФО.ПолучитьОписание(ЭтотОбъект);
	ОбщегоНазначенияУХ.УстановитьНовоеЗначение(Описание, НовоеЗначение);

КонецПроцедуры

#КонецЕсли

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Способы.Итог("Коэффициент") <> 100 Тогда
		ОбщегоНазначенияУХ.СообщитьОбОшибке(НСтр("ru = 'Сумма коэффициентов не равна 100'"), Отказ);
	КонецЕсли;
	
КонецПроцедуры
